Дана строка. Замените в этой строке все цифры 1 на слово one.



s = str(input('введите строку:\n'))
print(s.replace('1', 'one'))
 или

 S='1 home 1 dome'
 S.replace ('1', 'one')
